app/controllers/executives_controller.rb

SELECT "organizations".* FROM "organizations"
---
  def landing
    @organizations = Organization.all

INSERT INTO "executives" ("created_at", "email", "firstname", "lastname", "password_digest", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @executive = Executive.new(executive_params)
    if @executive.save

SELECT "executives".* FROM "executives"
---
  def index
    executives = Executive.all