app/controllers/organizations_controller.rb

  def index
    organizations = Organization.all
---
SELECT "organizations".* FROM "organizations"

  def create
    organization = Organization.create(org_params)
---
INSERT INTO "organizations" ("created_at", "name", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Thu, 27 Nov 2014 01:13:33 UTC +00:00], ["name", "Google"], ["updated_at", Thu, 27 Nov 2014 01:13:33 UTC +00:00]]