app/controllers/sessions_controller.rb

SELECT "executives".* FROM "executives" WHERE "executives"."email" = 'fuck' ORDER BY "executives"."id" ASC LIMIT 1
---
    def create
        executive = Executive.where(email: params[:email]).first